<p dir = 'rtl'>  درس سوم </p>

In [1]:
import pandas as pd

In [2]:
A = [
    [1,5,8,10],
    [3,2,2,7],
    [7,9,1,2],
    [6,8,2,1],
]

In [3]:
df1 = pd.DataFrame(A)
df1

   0  1  2   3
0  1  5  8  10
1  3  2  2   7
2  7  9  1   2
3  6  8  2   1

In [4]:
df1 = pd.DataFrame(A, columns=['Col1', 'Col2', 'Col3', 'Col4'])
df1

   Col1  Col2  Col3  Col4
0     1     5     8    10
1     3     2     2     7
2     7     9     1     2
3     6     8     2     1

In [5]:
df1.Col1

0    1
1    3
2    7
3    6
Name: Col1, dtype: int64

In [6]:
df1 = pd.DataFrame(
        A,
        columns=['Col1', 'Col2', 'Col3', 'Col4'],
        index=['A', 'B', 'C', 'D']
    )
df1

   Col1  Col2  Col3  Col4
A     1     5     8    10
B     3     2     2     7
C     7     9     1     2
D     6     8     2     1

In [7]:
A

[[1, 5, 8, 10], [3, 2, 2, 7], [7, 9, 1, 2], [6, 8, 2, 1]]

In [8]:
import numpy as np

In [9]:
B = np.array([
    [1, 5, 8, 10], [3, 2, 2, 7], [7, 9, 1, 2], [6, 8, 2, 1]
    ])

In [10]:
B

array([[ 1,  5,  8, 10],
       [ 3,  2,  2,  7],
       [ 7,  9,  1,  2],
       [ 6,  8,  2,  1]])

In [11]:
df2 = pd.DataFrame(
        B,
        columns=['Col1', 'Col2', 'Col3', 'Col4'],
        index=['A', 'B', 'C', 'D']
    )
df2

   Col1  Col2  Col3  Col4
A     1     5     8    10
B     3     2     2     7
C     7     9     1     2
D     6     8     2     1

In [12]:
data = {
    'A': [1,2,3,4],
    'B': [5,6,7,8],
    'C': [9,10,11,12],
}

In [13]:
df3 = pd.DataFrame(data)
df3

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [14]:
df4 = pd.DataFrame(data, 
                   index=['Item1', 'Item2', 'Item3', 'Item4'])

In [15]:
data

{'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8], 'C': [9, 10, 11, 12]}

In [16]:
df5 = pd.DataFrame(data, index=['I1', 'I2', 'I3', 'I4']).T
df5

   I1  I2  I3  I4
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12

In [17]:
data2 = {
    'A': {'x':1, 'y':2, 'z':3, 't':4},
    'B': {'x':5, 'y':6, 'z':7, 't':8},
    'C': {'x':9, 'y':10, 'z':11, 't':12},
}

In [18]:
df6 = pd.DataFrame(data2)
df6

   A  B   C
x  1  5   9
y  2  6  10
z  3  7  11
t  4  8  12

In [19]:
df7 = pd.DataFrame(data2).transpose()
df7

   x   y   z   t
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

In [20]:
df8 = pd.read_csv('C:/Users/Mahi/Desktop/project Pandas/Data/movies.csv', index_col='name')
df8.head()

,rating,genre,year,release_date,release_country,score,votes,director,writer,star,country,budget,gross,company,runtime
name,,,,,,,,,,,,,,,
The Shining,R,Drama,1980,"June 13, 1980",United States,8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
The Blue Lagoon,R,Adventure,1980,"July 2, 1980",United States,5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980",United States,8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
Airplane!,PG,Comedy,1980,"July 2, 1980",United States,7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
Caddyshack,R,Comedy,1980,"July 25, 1980",United States,7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [21]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7666 entries, The Shining to Tee em el
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   rating           7589 non-null   object
 1   genre            7666 non-null   object
 2   year             7666 non-null   int64
 3   release_date     7666 non-null   object
 4   release_country  7666 non-null   object
 5   score            7663 non-null   float64
 6   votes            7663 non-null   float64
 7   director         7666 non-null   object
 8   writer           7663 non-null   object
 9   star             7665 non-null   object
 10  country          7665 non-null   object
 11  budget           5497 non-null   float64
 12  gross            7479 non-null   float64
 13  company          7651 non-null   object
 14  runtime          7664 non-null   float64
dtypes: float64(5), int64(1), object(9)
memory usage: 958.2+ KB

In [22]:
df8.dtypes

rating              object
genre               object
year                 int64
release_date        object
release_country     object
score              float64
votes              float64
director            object
writer              object
star                object
country             object
budget             float64
gross              float64
company             object
runtime            float64
dtype: object

In [23]:
df7

   x   y   z   t
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

In [24]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      int64
 1   y       3 non-null      int64
 2   z       3 non-null      int64
 3   t       3 non-null      int64
dtypes: int64(4)
memory usage: 120.0+ bytes